<a href="https://colab.research.google.com/github/LaimengEung/inf-604-data-analysis-i-repo/blob/master/Lab1_Introduction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Lab1: Introduction to Data Analysis**

**Course**: **INF-604: Data Analysis** <br>
**Lecturer**: **Sothea HAS, PhD**

-----

**Objective:**  You have already seen some elements of Data Analysis in the course. In this lab, we will take our first step into working with the main element of Data Analysis, which is the dataset. By the end of this lab, you will be able to import data into a Jupyter Notebook and perform some data manipulation.

- Or you can work directly with `Google Colab` here: [Lab1_Introduction.ipynb](https://colab.research.google.com/drive/14L1fgW35_yZAW3BIsG-oGLxBO0lXANMO?usp=sharing).

-----

- `Student's name:` Jack
- `Year:`
- `Major:`
-----

## **1. Data for Your Business**

Imagine you want to start your own business, such as a coffee shop or a bookstore. What types of data do you think you need to gather to determine the potential success of your business? Here are some questions to help you think and answer this question:

- What is your plan for the business?

- What information might you need to collect?

- Would you likely collect those infornation as numbers or class/types?

- How large the sample size should be?

- After being collected, what do you think might be the problem with the data?

`Answer:`

---------

* I want to...

## **2. Importing Some Data**


There are many online data sources that you can explore, and one of the most popular is [`Kaggle`](https://www.kaggle.com/datasets/). In addition to datasets, `Kaggle` also hosts data competitions with prizes and offers courses to help you advance in data learning.


Here, we start our journey by exploring a dataset that you probably have heard its name before: [`Titanic`](https://www.kaggle.com/c/titanic/data/). You can download it from `Kaggle` using the following codes.

In [2]:
# %pip install kagglehub

import kagglehub

# Download latest version
path = kagglehub.dataset_download("yasserh/titanic-dataset")

# Pandas module allows you to import the data
import pandas as pd
data = pd.read_csv(path+'/Titanic-Dataset.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
# I want to import the data.
%ls {path}

path

 Volume in drive C is OS
 Volume Serial Number is B48A-5F46

 Directory of C:\Users\eungl\.cache\kagglehub\datasets\yasserh\titanic-dataset\versions\1

01/14/2026  12:22 PM    <DIR>          .
01/14/2026  12:22 PM    <DIR>          ..
01/14/2026  12:22 PM            61,194 Titanic-Dataset.csv
               1 File(s)         61,194 bytes
               2 Dir(s)  159,256,510,464 bytes free

'C:\\Users\\eungl\\.cache\\kagglehub\\datasets\\yasserh\\titanic-dataset\\versions\\1'

In [8]:
# Loading the dataset
import pandas as pd # pandas is the bos to work with data

data = pd.read_csv(path + '/Titanic-Dataset.csv')

data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

-------

### **2.1. Overview of the data**


Answer the following questions:

**A.** How many rows and columns are there in this dataset?

**B.** Explain the meaning of each column.

**C.** Are there any missing values in this dataset? If so, how many rows contain at least one missing value?

- What should you do with column `Cabin`?

- How would you drop rows with at least one missing value?


------------------

In [ ]:
# To do
# A. How many rows and columns?
data.shape

rows = len(data)
columns = len(data.columns)

# print(f"There are {rows} rows")
# print(f"There are {columns} columns")

The columns are:
PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

In [32]:
# B. Explain the meaning of each column:
print("\nThe columns are:")
for col in data.columns:
    print(col)

The columns are:
PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

**B.** Explain the meaning of each column:

* PassengerId: passenger ID
* Survived: binary column (0 or 1) of Survival, 0 = No, 1 = Yes 
* Pclass: Ticket Class (1, 2, and 3),           1 = 1st, 2 = 2nd, 3 = 3rd
* Name: Basically Name
* Sex: Sex
* Age: Age
* SibSp: Number of Siblings or Spouse aboard
* Parch: Number of Parents or Children aboard
* Ticket: Ticket Number
* Fare: Passenger fare
* Cabin: Cabin number
* Embarked: Port of Embarkation (C, Q or S);        C = Cherboug, Q = Queenstown, S = Southampton

In [ ]:
# C. look for missing values
data.isnull().sum()
data.isna().sum() / data.shape[0] * 100 # To find the percentage of the missing values

# If the column has just little missing values (Embarked), just get the rows with the NAN out. (Won't hurt the dataset much)
# If the column has too many missing values, just GET the whole IT TF OUT (Best Practice)
# 

    # Access Cabin column
# data['Cabin'].head()

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

_ As around 77% of `Cabin` are missing, so it's best to remove the entire column

In [75]:
# Drop rows
# data.drop(columns = ['Cabin'], inplace=True) # inplace to make changes to the actual data (without creating a new DataFrame or assign to a new variable)
# data.shape

# data_clean =data.dropna(subset=['Cabin']) # remove rows with at least one missing value.
# subset: to specify the column you want to dropna to!

data_cleaned = data.dropna()
data_cleaned.shape
# data_cleaned.isnull().sum() / len(data) * 100

(712, 11)

-------

### **2.2. Single information**


**D.** How many male and female passengers were on the ship?

**E.** How many of them survived? How many didn't?

**F.** How many passengers were younger than 3 years old? How many were older than 60 years old?

**G.** How many passengers embarked from the three ports?

- `C`: Cherbourg, France.
- `Q`: Queentown, Ireland.
- `S`: Southampton, England.

**H.** How many passengers were in the 1st, 2nd and 3rd class?

In [95]:
# To do
# D. Male and Female passengers aboard
data_cleaned['Sex']

male = len(data_cleaned[data_cleaned['Sex'] == 'male'])
female = len(data_cleaned[data_cleaned['Sex'] == 'female'])

print(f"There are {male} male, and {female} female")

# ORRRRRRR,
m = data_cleaned['Sex'].value_counts()[0]

data_cleaned['Sex'].value_counts(normalize=True) # To show proportion (in percentage)

There are 453 male, and 259 female

C:\Users\eungl\AppData\Local\Temp\ipykernel_21648\1356910001.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  m = data_cleaned['Sex'].value_counts()[0]

Sex
male      0.636236
female    0.363764
Name: proportion, dtype: float64

In [80]:
# E. How many of them Survived?
data_cleaned['Survived']

alive = len(data_cleaned[data_cleaned['Survived'] == 1])
dead = len(data_cleaned[data_cleaned['Survived'] == 0])

print(f"There are {alive} alive, and {dead} dead people")

There are 288 alive, and 424 dead people

In [98]:
# F.How many passengers were younger than 3 years old? How many were older than 60 years old?\
data_cleaned['Age']

under_3 = data_cleaned[data_cleaned['Age'] < 3]
over_60 = data_cleaned[data_cleaned['Age'] > 60]

print(f"1. Under 3: {len(under_3)}\n2. Over 60: {len(over_60)}")

1. Under 3: 24
2. Over 60: 21

In [131]:
# ORRRRRR, USING .query
over_60_query = data_cleaned.query("Age > 60").shape
over_60_query[0]

21

-------------

### **2.3. Multiple information**

**I.** How many 1st class passengers survived? How about 2nd and 3rd class?

**J.** How many female passengers survived? How many males did?

**K.** How many people from each embarkation port survived?

**L.** Was `Jack` on the ship? How about `Rose`?

In [100]:
# To do
# I. How many 1st class survived?
for i in data_cleaned['Pclass'].value_counts():
    print(i)
# first_class_survived =

355
184
173

In [124]:
# J. How many female and male survived
survived_by_gender = data_cleaned.groupby(['Survived', 'Sex']).size()

survived_by_gender

Survived  Sex
0         female     64
          male      360
1         female    195
          male       93
dtype: int64

In [136]:
# K. how many people from each embarkment survived
survived_by_port = data_cleaned.groupby(['Survived', 'Embarked']).size()

survived_by_port

Survived  Embarked
0         C            51
          Q            20
          S           353
1         C            79
          Q             8
          S           201
dtype: int64

In [154]:
# L. Were Jack and Rose on the ship
j_r = data_cleaned[data_cleaned['Name'].str.lower().str.contains('john')]
# data_cleaned
j_r

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S
41,42,0,2,"Turpin, Mrs. William John Robert (Dorothy Ann ...",female,27.0,1,0,11668,21.0000,S
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,S
112,113,0,3,"Barton, Mr. David John",male,22.0,0,0,324669,8.0500,S
117,118,0,2,"Turpin, Mr. William John Robert",male,29.0,1,0,11668,21.0000,S
160,161,0,3,"Cribb, Mr. John Hatfield",male,44.0,0,1,371362,16.1000,S
162,163,0,3,"Bengtsson, Mr. John Viktor",male,26.0,0,0,347068,7.7750,S
165,166,1,3,"Goldsmith, Master. Frank John William ""Frankie""",male,9.0,0,2,363291,20.5250,S
172,173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.0,1,1,347742,11.1333,S
188,189,0,3,"Bourke, Mr. John",male,40.0,1,1,364849,15.5000,Q
212,213,0,3,"Perkin, Mr. John Henry",male,22.0,0,0,A/5 21174,7.2500,S
226,227,1,2,"Mellors, Mr. William John",male,19.0,0,0,SW/PP 751,10.5000,S
227,228,0,3,"Lovell, Mr. John Hall (""Henry"")",male,20.5,0,0,A/5 21173,7.2500,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,S
328,329,1,3,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1,1,363291,20.5250,S
401,402,0,3,"Adams, Mr. John",male,26.0,0,0,341826,8.0500,S
418,419,0,2,"Matthews, Mr. William John",male,30.0,0,0,28228,13.0000,S
467,468,0,1,"Smart, Mr. John Montgomery",male,56.0,0,0,113792,26.5500,S
548,549,0,3,"Goldsmith, Mr. Frank John",male,33.0,1,1,363291,20.5250,S
549,550,1,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,S
550,551,1,1,"Thayer, Mr. John Borland Jr",male,17.0,0,2,17421,110.8833,C
572,573,1,1,"Flynn, Mr. John Irwin (""Irving"")",male,36.0,0,0,PC 17474,26.3875,S
574,575,0,3,"Rush, Mr. Alfred George John",male,16.0,0,0,A/4. 20589,8.0500,S
581,582,1,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0,1,1,17421,110.8833,C
583,584,0,1,"Ross, Mr. John Hugo",male,36.0,0,0,13049,40.1250,C
586,587,0,2,"Jarvis, Mr. John Denzil",male,47.0,0,0,237565,15.0000,S
594,595,0,2,"Chapman, Mr. John Henry",male,37.0,1,0,SC/AH 29037,26.0000,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,S
624,625,0,3,"Bowen, Mr. David John ""Dai""",male,21.0,0,0,54636,16.1000,S
657,658,0,3,"Bourke, Mrs. John (Catherine)",female,32.0,1,1,364849,15.5000,Q
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.5500,S
698,699,0,1,"Thayer, Mr. John Borland",male,49.0,1,1,17421,110.8833,C
700,701,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,PC 17757,227.5250,C
719,720,0,3,"Johnson, Mr. Malkolm Joackim",male,33.0,0,0,347062,7.7750,S
733,734,0,2,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,S
765,766,1,1,"Hogeboom, Mrs. John C (Anna Andrews)",female,51.0,1,0,13502,77.9583,S
818,819,0,3,"Holm, Mr. John Fredrik Alexander",male,43.0,0,0,C 7075,6.4500,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,S
848,849,0,2,"Harper, Rev. John",male,28.0,0,1,248727,33.0000,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,S
869,870,1,3,"Johnson, Master. Harold Theodor",male,4.0,1,1,347742,11.1333,S

# **Further Reading**

- `Pandas` python library: https://pandas.pydata.org/docs/getting_started/index.html#getting-started

- `10 Minute to Pandas`: https://pandas.pydata.org/docs/user_guide/10min.html

- `Some Pandas Lession`: https://www.kaggle.com/learn/pandas

---------